Revit 2024 API
BuiltInFailures.StructuralConnectionFailures.StructuralConnectionTypeInfoNotAvailable Property
 There is no add-on installed which supports Structural Connection type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId StructuralConnectionTypeInfoNotAvailable { get; }
Visual Basic
Public Shared ReadOnly Property StructuralConnectionTypeInfoNotAvailable As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ StructuralConnectionTypeInfoNotAvailable {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StructuralConnectionFailures Class
Autodesk.Revit.DB Namespace